#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.main will be created
  + resource "azurerm_network_security_group" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "nsg-main-westus-01"
      + resource_group_name = "vnet-main-westus-01"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.http will be created
  + resource "azurerm_network_security_rule" "http" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-HTTP"
      + network_security_group_name = "nsg-main-westus-01"
      + priority                    = 1001
      + protocol                    = "Tcp"
      + resource_group_name         = "vnet-main-westus-01"
      + source_address_prefixes     = [
          + "*",
        ]
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.https will be created
  + resource "azurerm_network_security_rule" "https" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-HTTPS"
      + network_security_group_name = "nsg-main-westus-01"
      + priority                    = 1002
      + protocol                    = "Tcp"
      + resource_group_name         = "vnet-main-westus-01"
      + source_address_prefixes     = [
          + "*",
        ]
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.ssh will be created
  + resource "azurerm_network_security_rule" "ssh" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-SSH"
      + network_security_group_name = "nsg-main-westus-01"
      + priority                    = 1000
      + protocol                    = "Tcp"
      + resource_group_name         = "vnet-main-westus-01"
      + source_address_prefixes     = [
          + "135.26.169.31/32",
          + "64.71.11.101/32",
          + "70.35.45.100/32",
        ]
      + source_port_range           = "*"
    }

  # azurerm_subnet_network_security_group_association.main will be created
  + resource "azurerm_subnet_network_security_group_association" "main" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/4880ac71-6ef8-445b-980b-9a11ded3af6f/resourceGroups/rg-vnet-main-westus-01/providers/Microsoft.Network/virtualNetworks/vnet-main-westus-01/subnets/snet-main-westus-01"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @manrajsingh, Action: `pull_request`, Workflow: `Terraform CI/CD`*